tap "elastic/tap"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Generic library support script
brew "libtool"
# YAML Parser
brew "libyaml"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Core application library for C
brew "glib"
# Text processing system for reStructuredText
brew "docutils"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# X.509 and CMS library
brew "libksba"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Database of common MIME types
brew "shared-mime-info"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Portable Foreign Function Interface library
brew "libffi"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Open source relational database management system
brew "mysql@8.0"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: :changed
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Maintained ctags implementation
brew "universal-ctags", args: ["HEAD"]
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Distributed search & analytics engine
brew "elastic/tap/elasticsearch-full"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-hack"
cask "font-symbols-only-nerd-font"
# Keyboard customiser
cask "karabiner-elements"
# App to write, plan, collaborate, and get organised
cask "notion"
# Collaboration platform for API development
cask "postman"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Messaging app with a focus on speed and security
cask "telegram"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "alexanderte.dainty-one-dark-pro-vscode"
vscode "atlassian.atlascode"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "kaiwood.endwise"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "nguyenngoclong.asdf"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "sirtori.indenticator"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
